{
    "solution": "1428B - Belted RoomsSetter: oolimryPrepared by: oolimry Hint 1There are 2 cases to consider for a room to be returnable. Hint 2For a room to be returnable, either go one big round around all the rooms or move to an adjacent room and move back. SolutionLet's consider two ways to return to the start point. The first is to go one big round around the circle. The second is to move 1 step to the side, and return back immediately.Going one big round is only possible if and only if:  There are no clockwise belts OR There are no anticlockwise belts If we can go one big round, all rooms are returnable.If there are both clockwise and anticlockwise belts, then we can't go one big round. For any room to be returnable, it must have an off belt to the left or to the right. In summary, check if clockwise belts are absent or if anticlockwise belts are absent. If either is absent, the answer is n. Otherwise, we have to count the number of rooms with an off belt to the left or to the right. Other commentsSorry for the unclear statement for B, we should've explained each sample testcase more clearly with better diagrams. Additionally, we're also sorry for the weak pretests. We should've added more testcases of smaller length, and thanks to hackers for adding stronger tests. Code (C++)#include <bits/stdc++.h>\nusing namespace std;\n\nint main(){\n\tios_base::sync_with_stdio(false); cin.tie(0);\n\t\n\tint TC; cin >> TC;\n\twhile(TC--){\n\t\tint n; cin >> n;\n\t\tstring s; cin >> s;\n\t\t\n\t\tbool hasCW = false;\n\t\tbool hasCCW = false;\n\t\tfor(int i = 0;i < n;i++){\n\t\t\tif(s[i] == '<') hasCW = true;\n\t\t\tif(s[i] == '>') hasCCW = true;\n\t\t}\n\t\t\n\t\tif(hasCW && hasCCW){\n\t\t\tint ans = 0;\n\t\t\ts += s[0];\n\t\t\tfor(int i = 0;i < n;i++){\n\t\t\t\tif(s[i] == '-' || s[i+1] == '-') ans++;\n\t\t\t}\n\t\t\tcout << ans << \"\\n\";\n\t\t}\n\t\telse{\n\t\t\tcout << n << \"\\n\";\n\t\t}\n\t}\n} Code (Python)TC = int(input())\nfor tc in range(TC):\n    n = int(input())\n    s = input()\n\n    hasCW = False\n    hasCCW = False \n    for c in s:\n        if c == '>':\n            hasCW = True\n        if c == '<':\n            hasCCW = True\n            \n    if hasCW and hasCCW:\n        s += s[0]\n        ans = 0;\n        for i in range(n):\n            if s[i] == '-' or s[i+1] == '-':\n                ans += 1\n        print(ans)\n        \n    else:\n        print(n)"
}