{
    "solution": "1509B - TMT DocumentThere are many slightly different solutions, all based on some sort of greedy idea. Write n=3k for convenience. Obviously, the string must have k characters M and 2k characters T for the partition to be possible, so we can just discard all other cases.Now, let's consider the first M character in the string. This must be part of some TMT subsequence, so we must choose a T character to its left to work as the first character of this subsequence. Which character should we choose? Well, it seems intuitive to match it with the first T character we find going from left to right - it is certainly not the right character of any sequence, and it seems like a good idea to assign it to the first M character since characters that are further to the right may be too far right to match with this character.Continuing this idea, we come up with the following greedy algorithm: Take the first k T characters and use them as the first characters of the subsequences, matching them with the k M characters from left to right greedily. Similarly, take the last k T characters and match them with each M character from left to right greedily. If either of these steps fails, the partition is impossible. This can be formalized into the following observation, which is both easy to prove and gives a solution that is very easy to implement.Claim. Let m1<m2<⋯<mk be the positions of the M characters and let t1<t2<⋯<t2k be the positions of the T characters. Then the partition exists if and only if ti<mi<ti+k for 1≤i≤k.Proof. If the condition holds then we can just choose the k subsequences with indices (ti,mi,ti+k), so it is sufficient. To see that it's necessary, consider the first i M characters with indices m1,m2,…,mi, and consider the left T characters in the subsequence they're in. These are to the left of their corresponding M characters, and in particular they are to the left of the i-th M character. Thus there's at least i T characters to the left of the i-th M character, meaning ti<mi. The other inequality is proved similarly. Comments from the authorsDo yourself a favor and listen to Towa-sama's singing! Here are some links to cool songs.Implementation"
}