{
    "solution": "1944B - Equal XORIdea : satyam343Preparation : satyam343Editorial : Dominater069 Hint 1Group numbers according to how many times they occur in a[1...n]. Hint 2The group of numbers having 0 occurrences in a[1...n] is of the same size as the group of numbers having 2 occurences in a[1...n]. Hint 3Try to use the 0 and 2 occurrence numbers first, and then if we still need more, we can use the 1 occurence numbers. Remember that we have to form sequences of size 2⋅k which is even. SolutionWe can append any 2 occurrence numbers to our sequence l and any 0 occurrence numbers to our sequence r without any issue because the xor value will cancel out. We do this while our sequence sizes are less than 2⋅k. At the end of this process, l and r will have the same size due to Hint 2.Now, we use as many 1 occurrence numbers appending to both l and r as needed. Since we append to both sequences, the xor value of the 2 sequences will be the same.If we had to solve for odd sequence sizes, we could take a 1 occurrence number at the very start to make it even, and then run the same process, but if there are no 1 occurrence numbers at all, we fail with this method. Code#include <bits/stdc++.h>\nusing namespace std;\n\nint main(){\n    int t; cin >> t;\n    while (t--){\n        int n, k; \n        cin >> n >> k; \n        k = 2 * k;\n        \n        vector <int> a(2 * n), occ(n + 1, 0);\n        \n        for (auto &x : a) cin >> x;\n        for (int i = 0; i < n; i++) occ[a[i]]++;\n        \n        vector <int> g0, g1, g2;\n        for (int i = 1; i <= n; i++){\n            if (occ[i] == 0) g0.push_back(i);\n            else if (occ[i] == 1) g1.push_back(i);\n            else g2.push_back(i);\n        }\n        \n        int v = 0;\n        for (auto x : g2){\n            if (v < k){\n                v += 2;\n                cout << x << \" \" << x << \" \";\n            }\n        }\n        for (auto x : g1){\n            if (v < k){\n                v++;\n                cout << x << \" \";\n            }\n        }\n        cout << \"\\n\";\n        \n        v = 0;\n        for (auto x : g0){\n            if (v < k){\n                v += 2;\n                cout << x << \" \" << x << \" \";\n            }\n        }\n        for (auto x : g1){\n            if (v < k){\n                v++;\n                cout << x << \" \";\n            }\n        }\n        cout << \"\\n\";\n    }\n    return 0;\n}"
}