{
    "solution": "1982C - Boring DaySolution 1:Let dp[i] — the maximum number of rounds won by Egor for the first i elements (top cards). It is possible to come up with a solution in O(n2) right now. For each state of the dynamic programming i, you can either skip the next card (not take it in any winning segment), or iterate over the length of the segment that will start with the next card. If you calculate prefix sums and compute the sum over a segment in O(1), the solution works exactly in O(n2).Let's try to optimize the transitions in such a dynamic.First, it can be noticed that all ai are positive, which means that the sum of the segment (a,b) will be less than (a,b+1). This means that the first suitable segment (with a sum ≥l) can be found using binary search or two pointers.Secondly, if the segment has a suitable sum (from l to r), it does not make sense to increase its length, as this can only worsen the answer.Thus, for each state of the dynamic programming, there are only O(1) transitions, so the entire problem can be solved in O(n) or O(nlogn).Solution 2:Let's try to solve the problem greedily. Let's look for a segment (a,b) in the prefix such that the sum of all its elements is not less than l and not greater than r, and among all such segments, we will take the segment with the minimum b. After that, we will consider that the array starts from the (b+1)-th element and continue to search for the next segment in the same way.How to find (a,b)? Let's start by finding the minimum prefix k (which is also the segment (1,k)) such that the sum of the elements in it is ≥l. If this sum is also not greater than r, then this prefix is the segment we need (a,b). Otherwise, we know that the sum of the elements in any subsegment of this prefix that does not contain the last element ak is less than l, so we can try to find a subsegment that ends at k, for this, we can iterate over the left boundary from 1 to k. At the same time, the sum of the elements in the iterated segment will decrease and it may happen again that at some point it becomes <l, in this case, we already know that we will not find the required segment with the right boundary k, so it needs to be increased (again until the sum becomes ≥l). By repeating these actions, we will either find the required segment (a,b), or the right boundary will become equal to n. The algorithm is nothing but \"two pointers\", we keep two boundaries l and r and move them only to the right, so in total, this all works in O(n). Solution 1 (FelixArg)#include <bits/stdc++.h>\n \nusing namespace std;\n \nconst int inf = 1000000007;\n \nvoid solve(){\n\tint n, l, r;\n\tcin >> n >> l >> r;\n\tvector<int> a(n);\n\tfor (int i = 0; i < n; i++){\n\t\tcin >> a[i];\n\t}\n \n\tvector<long long> pref(n + 1);\n\tfor (int i = 0; i < n; i++){\n\t\tpref[i + 1] = pref[i] + a[i];\n\t}\n \n\tvector<int> dp(n + 1);\n\tint s = 0;\n\tint j = -1;\n\tfor (int i = 0; i < n; i++){\n\t\tdp[i + 1] = max(dp[i + 1], dp[i]);\n\t\tif (j < i){\n\t\t\tj = i;\n\t\t\ts = 0;\n\t\t}\n\t\twhile(j < n && s < l){\n\t\t\ts += a[j++];\n\t\t}\n\t\tif (s >= l && s <= r){\n\t\t\tdp[j] = max(dp[j], dp[i] + 1);\n\t\t}\n\t\ts -= a[i];\n\t}\n \n\tcout << dp[n] << '\\n';\n}\n \nint main()\n{\n#ifdef FELIX\n\tauto _clock_start = chrono::high_resolution_clock::now();\n#endif\n\tios_base::sync_with_stdio(false);\n\tcin.tie(0);\n\tcout.tie(0);\n\tint tests = 1;\n\tcin >> tests;\n\tfor (int test = 0; test < tests; test++){\n\t\tsolve();\n\t}\n#ifdef FELIX\n\tcerr << \"Executed in \" << chrono::duration_cast<chrono::milliseconds>(\n\t\tchrono::high_resolution_clock::now()\n\t\t\t- _clock_start).count() << \"ms.\" << endl;\n#endif\n\treturn 0;\n} Solution 2 (74TrAkToR)t = int(input())\nfor T in range(t):\n\tn, l, r = map(int, input().split())\n\ta = [int(x) for x in input().split()]\n\tans = 0\n\tcur = 0\n\tL, R = 0, 0\n\twhile L < n:\n\t\twhile R < n and cur < l:\n\t\t\tcur += a[R]\n\t\t\tR += 1\n\t\tif l <= cur and cur <= r:\n\t\t\tans += 1\n\t\t\tL = R\n\t\t\tcur = 0\n\t\telse:\n\t\t\tcur -= a[L]\n\t\t\tL += 1\n\tprint(ans)"
}