{
    "time_limit": "2 seconds",
    "memory_limit": "256 megabytes",
    "tags": [
        "binary search",
        "greedy",
        "two pointers",
        "*3300"
    ],
    "solution": [
        "Instead of doing the check for ans≥ians≥i in O(m3)O(m3), we will do it in O(m)O(m).",
        "For an array ff of length nn. Let s=f1+f2+…+fns=f1+f2+…+fn be the sum of the element. ff will be called flat if fi=⌊s+i−1n⌋fi=⌊s+i−1n⌋. That is, it has the form x,…,x,x+1,…x+1x,…,x,x+1,…x+1. All flat array can be characters by 22 integers (n,s)(n,s) only.",
        "Imagine simulating Bob's strategy without simulating Alice's moves of removing the first element of the array. For some prefix of the moves, the actual simulation will be a suffix of this simulation. This is because to subtract something from index ≤i≤i, we must have fi+1=fi+2=…=fnfi+1=fi+2=…=fn.",
        "As an example, let k=4k=4.",
        "With Alice moves: [1,2,3,5,5]→[2,3,3,3]→[1,2,2][1,2,3,5,5]→[2,3,3,3]→[1,2,2]",
        "Without Alice moves: [1,2,3,5,5]→[1,2,3,3,3]→[1,1,2,2,2][1,2,3,5,5]→[1,2,3,3,3]→[1,1,2,2,2]",
        "[1,2,2][1,2,2] is not a suffix of [1,1,2,2,2][1,1,2,2,2] and is the first time such a thing happens.",
        "Suppose that the first time this happens is after pp moves. Then the resulting array is the flat array (n−p,fp+1+fp+2+…+fn−pk)(n−p,fp+1+fp+2+…+fn−pk). To find the necessary value of pp, we can binary search or run 22-pointers to check if the suffix of the array can reach fpfp with the amount of subtraction operations till then. (What we basically did is find the suffix of the array that actually gets operated on, since that makes it much more easier to solve)",
        "Then, since the flat array (n,s)(n,s) becomes (n−1,s−⌊sn⌋−k)(n−1,s−⌊sn⌋−k), we can figure out whether each flat array evantually becomes a losing or winning state as we can calculate for each nn, the minimum ss such that (n,s)(n,s) is a winning state."
    ]
}