{
    "time_limit": "2 seconds",
    "memory_limit": "256 megabytes",
    "tags": [
        "*special problem",
        "combinatorics",
        "*2000"
    ],
    "solution": [
        "If there are no blocked cells, then there are a total of nn different paths. Initially, Monocarp goes to the right, then descends in some column and goes all the way to the right. That is, the chosen column determines the path.",
        "Now with blocked cells. Why might a path be inaccessible? Either Monocarp cannot go further to the right, or one of the cells in the column is blocked, or it cannot reach the end to the right. From this, the following conclusion can be drawn. In the first row, only the leftmost blocked cell is important, and in the second row, only the rightmost one is important.",
        "If in the first row the leftmost blocked cell is at position xx, and the rightmost in the second row is at position yy, then Monocarp has access to x−y+1x−y+1 paths. We will deal with the case when there are no blocked cells in one of the rows later.",
        "It can be noticed that the difference can be non-positive, but this simply means that there are 00 paths. In practice, this case can be eliminated by calculating all the positive answers and subtracting them from the total number of ways to choose kk blocked cells out of 2n−22n−2 options.",
        "Let's say we have fixed x−y=dx−y=d. Then the two fixed cells can be at positions (d+1,1),(d+2,2),…,(n,n−d)(d+1,1),(d+2,2),…,(n,n−d). In the case of (d+1,1)(d+1,1), the remaining k−2k−2 cells can be chosen from among n−(d+1)n−(d+1) to the right of the first cell and among 00 to the left of the second cell, totaling n−(d+1)n−(d+1). In the case of (d+1,1)(d+1,1), this is n−(d+2)n−(d+2) and 11, again totaling n−(d+1)n−(d+1). That is, with a fixed difference, we always have the same number of ways to choose the remaining k−2k−2 cells — (n−d−1k−2)(n−d−1k−2). And we know that the positions for the two cells can be chosen in n−dn−d ways. That is, the contribution to the answer for d−1d−1 is (n−d−1k−2)⋅(n−d)(n−d−1k−2)⋅(n−d).",
        "We still need to deal with the ways in which one of the rows has no blocked cells. Let's assume this is the case for the second row. Then the number of paths is still determined by the position of the leftmost blocked cell in the first row. Let's iterate over it and count the ways to arrange the remaining k−1k−1 cells. There are (n−i−1k−1)(n−i−1k−1) ways for the cell at position ii.",
        "If there are no blocked cells in the second row, then the answer is exactly the same. We iterate over the position of the rightmost cell and arrange the rest. It turns out to be symmetrical to the first method, so the formula is the same. We just calculate it once and multiply by 22.",
        "You can pre-calculate factorials to compute the binomial coefficient in O(n+logMOD)O(n+log⁡MOD).",
        "Overall complexity: O(n+logMOD)O(n+log⁡MOD)."
    ]
}