{
    "time_limit": "4 seconds",
    "memory_limit": "512 megabytes",
    "tags": [
        "dp",
        "number theory",
        "*3200"
    ],
    "solution": "2039F1 - Shohag Loves Counting (Easy Version)Letskskbe the sequence ofkklength subarray maximums of the array. Thensk+1sk+1is just the adjacent maximum sequence ofsksk.Also, letgkgkbe the GCD of the elements ofsksk. Then notice that every element ofsk+1sk+1is also divisible bygkgk. That isgkgkdividesgk+1gk+1.For the array to be good,gkgkmust be different for allkk. Sogk<gk+1gk<gk+1andgkgkdividesgk+1gk+1. This means if the length of the array isnn, thenn≤⌊log2m⌋+1n≤⌊log2⁡m⌋+1.Now consider a non-decreasing sequence of integersaaof lengthnnsuch that1≤ai≤m1≤ai≤mfor allii. Then thekklength subarray maximums ofaaare just the lastkkelements ofaa. Sogkgkis the GCD of the lastkkelements ofaa. Then forgkgkto be different for allkk, all the elements ofaamust be distinct. So the condition foraato be good is that the elements are distinct and all suffix GCDs are distinct as well.Next the question is how many permutations of this increasing sequenceaais good as well? To count this, lets start fromsnsn.snsnis just[an][an]. Now considersn−1sn−1. We need to putan−1an−1in the sequence such that the adjacent maximum sequence ofsn−1sn−1becomessnsn. For this we clearly have22ways:[an−1,an][an−1,an]and[an,an−1][an,an−1].Now considersn−2sn−2. We need to putan−2an−2in the sequence such that the adjacent maximum sequence ofsn−2sn−2becomessn−1sn−1. For this we again have22ways becausean−2an−2can be inserted in22places: beforean−1an−1or afteran−1an−1.Similarly for all otherskskwe have22ways to insert it: putting it beforeak+1ak+1or afterak+1ak+1. So the total number of good permutations ofaais2n−12n−1.So our problem reduces to the following:Select a lengthnnsuch that1≤n≤⌊log2m⌋+11≤n≤⌊log2⁡m⌋+1.Count the number of strictly increasing sequences of lengthnnsuch that all suffix GCDs are distinct.Multiply the answer by2n−12n−1.Sum up the answer for all validnn.For a fixednn, let's count the number of strictly increasing sequences of lengthnnsuch that all suffix GCDs are distinct.Letdpi,gdpi,gbe the number of strictly increasing sequences of lengthnnsuch that the starting element isiiand the GCD of the elements isgg.Now iterate fromi=mi=mto11. Then the transition is to iterate over the next suffix GCDhhsuch thatggdivideshh,g<h≤mg<h≤mandg=gcd(i,h)g=gcd(i,h)and then adddp∗,hdp∗,htodpi,gdpi,g. Heredp∗,hdp∗,his the sum of alldpj,hdpj,hfor allj>ij>i.Another way to look at the transition is that for a fixedii, we iterate over allhhand ifgcd(i,h)<hgcd(i,h)<h, then we adddp∗,hdp∗,htodpi,gcd(i,h)dpi,gcd(i,h).But doing everything like this would still beO(m2logm)O(m2log⁡m)which is too slow.Notice that allggare the divisors ofii. Here the main difficulty is that we need update at the indexgcd(i,h)gcd(i,h)over allhhbut it is hard to track the exact gcd but what's easier is to track the multiple of the gcd.So for eachgg, let's say we know the sum of alldp∗,hdp∗,hover allhhsuch thatggdivideshh. So this sums up alldp∗,hdp∗,hsuch thatggdividesgcd(i,h)gcd(i,h).Then using inclusion exclusion on the divisors ofiiwe can get the sum of alldp∗,hdp∗,hfor allhhsuch thatggis exactlygcd(i,h)gcd(i,h). This will takeO(σ(i)2)O(σ(i)2)time for eachiiwhereσ(i)σ(i)is the number of divisors ofii.And once we calculate thedpi,gdpi,gfor someiiandgg, then before transitioning toi−1i−1, we can add the value ofdpi,gdpi,gto all divisors ofggto get the value ofdp∗,hdp∗,hfaster in the future. To keep track of this, we can use a separate array.So for a fixednn, the time complexity isO(∑mi=1σ(i)2)O(∑i=1mσ(i)2). And we need to do this for allnnfrom11to⌊log2m⌋+1⌊log2⁡m⌋+1.So the overall time complexity isO(logm⋅∑mi=1σ(i)2)O(log⁡m⋅∑i=1mσ(i)2). We actually allowed this to pass in F1.We can make the time complexity much better with a simple modification in the dp. Note that we don't need to use the length of array in the dp state. As we need to sum up after multiplying by2length of array−12length of array−1at the end, we can modify the dp to directly store the sum of2length of array−12length of array−1. So we can just multiply the dp by22during each transition.So the time complexity becomesO(∑mi=1σ(i)2)O(∑i=1mσ(i)2). This is very fast for F1."
}