{
    "time_limit": "2 seconds",
    "memory_limit": "256 megabytes",
    "tags": [
        "brute force",
        "constructive algorithms",
        "number theory",
        "*3000"
    ],
    "solution": [
        "Fact 1: If for (x,y,z)(x,y,z) their pairwise GCDs are equal to their common GCD (this means that (x,y,z)(x,y,z) = (g∗X,g∗Y,g∗Z)(g∗X,g∗Y,g∗Z) where (X,Y,Z)(X,Y,Z) are pairwise coprime), then making an operation on them (gives (g∗X∗Y,g∗X∗Z,g∗Y∗Z)(g∗X∗Y,g∗X∗Z,g∗Y∗Z)) and looking at the subsequences of size EXACTLY 2, we find all three GCD: xx, yy, zz. Let's call such tuple NICE.",
        "Result: If we can split all values in the array into independent NICE tuples, then we can just perform an operation on each of them and the problem is solved.",
        "Fact 2: We don't touch any value ≤≤ n2n2. If there is xx ≤≤ n2n2, then 2∗x≤n2∗x≤n. If we don't touch xx, then we will always have another value that is divisible by xx (it's easy to see that performing an operation on a multiple of xx leaves us with another multiple of xx), so we will always have GCD equal to xx taking a subsequence (x,x∗A)(x,x∗A).",
        "Fact 3: A sequence of consecutive integers (x,x+1,x+2,...,x+11)(x,x+1,x+2,...,x+11) can be partitioned into 44 disjoint sets of size 33, each forming a NICE tuple, if (x+11)%4(x+11)%4 equals 22 or 11.",
        "For (x+11)%4=2(x+11)%4=2: The sets (x,x+1,x+2)(x,x+1,x+2), (x+4,x+5,x+6)(x+4,x+5,x+6) and (x+8,x+9,x+10)(x+8,x+9,x+10) are NICE because, the first and third terms are always odd, and the second term is always even. The set (x+3,x+7,x+11)(x+3,x+7,x+11) is NICE because it has the form of 2∗(2∗n−1)2∗(2∗n−1), 2∗(2∗n)2∗(2∗n), 2∗(2∗n+1)2∗(2∗n+1), ensuring that the pairwise GCDs are equal to the common GCD.",
        "For (x+11)%4=1(x+11)%4=1: The sets (x,x+4,x+8)(x,x+4,x+8), (x+1,x+2,x+3)(x+1,x+2,x+3), (x+5,x+6,x+7)(x+5,x+6,x+7) and (x+9,x+10,x+11)(x+9,x+10,x+11) are NICE, the same logic like (x+11)%4=2(x+11)%4=2 follows,",
        "If n%4=3n%4=3 we can do one operation as (1,2,n)(1,2,n), and if n%4=0n%4=0 we can do one operation as (1,n−1,n)(1,n−1,n). Let's group the remaining elements into the groups of size 1212, starting from the end, and continuing until we reach the number n2n2.",
        "Eventually, we can count that we used no more than ⌊n6⌋+5⌊n6⌋+5 operations.",
        "Solutions for n≤13n≤13 should be found manually."
    ]
}