{
    "title": "B. Balls of Steel",
    "description": "You have n distinct points (x1,y1),…,(xn,yn) on the plane and a non-negative integer parameter k. Each point is a microscopic steel ball and k is the attract power of a ball when it's charged. The attract power is the same for all balls.\nIn one operation, you can select a ball i to charge it. Once charged, all balls with Manhattan distance at most k from ball i move to the position of ball i. Many balls may have the same coordinate after an operation.\nMore formally, for all balls j such that |xi−xj|+|yi−yj|≤k, we assign xj:=xi and yj:=yi.\nYour task is to find the minimum number of operations to move all balls to the same position, or report that this is impossible.\nThe first line contains a single integer t (1≤t≤100) — the number of test cases.\nThe first line of each test case contains two integers n, k (2≤n≤100, 0≤k≤106) — the number of balls and the attract power of all balls, respectively.\nThe following n lines describe the balls' coordinates. The i-th of these lines contains two integers xi, yi (0≤xi,yi≤105) — the coordinates of the i-th ball.\nIt is guaranteed that all points are distinct.\nFor each test case print a single integer — the minimum number of operations to move all balls to the same position, or −1 if it is impossible.\nIn the first test case, there are three balls at (0,0), (3,3), and (1,1) and the attract power is 2. It is possible to move two balls together with one operation, but not all three balls together with any number of operations.\nIn the second test case, there are three balls at (6,7), (8,8), and (6,9) and the attract power is 3. If we charge any ball, the other two will move to the same position, so we only require one operation.\nIn the third test case, there are four balls at (0,0), (0,1), (0,2), and (0,3), and the attract power is 1. We can show that it is impossible to move all balls to the same position with a sequence of operations.",
    "time limit": "time limit per test1 second",
    "memory limit": "memory limit per test256 megabytes",
    "tags": [
        "brute force",
        "geometry",
        "greedy",
        "*1000"
    ]
}