{
    "title": "C. Jumping on Tiles",
    "description": "Polycarp was given a row of tiles. Each tile contains one lowercase letter of the Latin alphabet. The entire sequence of tiles forms the string s.\nIn other words, you are given a string s consisting of lowercase Latin letters.\nInitially, Polycarp is on the first tile of the row and wants to get to the last tile by jumping on the tiles. Jumping from i-th tile to j-th tile has a cost equal to |index(si)−index(sj)|, where index(c) is the index of the letter c in the alphabet (for example, index('a')=1, index('b')=2, ..., index('z')=26) .\nPolycarp wants to get to the n-th tile for the minimum total cost, but at the same time make maximum number of jumps.\nIn other words, among all possible ways to get to the last tile for the minimum total cost, he will choose the one with the maximum number of jumps.\nPolycarp can visit each tile at most once.\nPolycarp asks you to help — print the sequence of indices of string s on which he should jump.\nThe first line of the input contains an integer t (1≤t≤104) — the number of test cases in the test.\nEach test case is given by the string s (2≤|s|≤2⋅105), where |s| — is the length of string s. The string s consists of lowercase Latin letters.\nIt is guaranteed that the sum of string lengths s over all test cases does not exceed 2⋅105.\nThe answer to each test case consists of two lines.\nIn the first line print two integers cost, m, where cost is the minimum total cost of the path, and m is the maximum number of visited tiles Polycarp can make to get to n-th tiles for the minimum total cost cost (i.e. the number of jumps is m−1).\nIn the next line print m different numbers j1,j2,…,jm (1≤ji≤|s|) — the sequence of indices of the tiles Polycarp will jump on. The first number in the sequence must be 1 (that is, j1=1) and the last number must be the value of |s| (that is, jm=|s|).\nIf there are multiple answers, print any of them.\nIn the first test case, the required path corresponds to the picture:\nIn this case, the minimum possible total cost of the path is achieved. Since index('l')=12, index('o')=15, index('g')=7, index('i')=9, index('c')=3, then the total cost of the path is |12−9|+|9−7|+|7−3|=3+2+4=9.",
    "time limit": "time limit per test1 second",
    "memory limit": "memory limit per test256 megabytes",
    "tags": [
        "constructive algorithms",
        "strings",
        "*1100"
    ]
}